module.exports = {
  semi: true, // использовать точку с запятой в конце выражений
  singleQuote: true, // использовать одинарные кавычки вместо двойных
  trailingComma: 'all', // добавлять запятые после последнего элемента в объектах и массивах
  tabWidth: 2, // количество пробелов для отступа
  useTabs: false, // использовать пробелы вместо табуляций
  bracketSpacing: true, // добавлять пробелы между скобками в объектах
  jsxBracketSameLine: false, // закрывающая скобка в JSX на новой строке
  printWidth: 80, // максимальная длина строки, после которой происходит перенос
};